OpenFOAM-dev/tutorials/incompressibleDenseParticleFluid/injectionChannel/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        action  new;
        type    faceZoneSet;
        name    mid;
        source  planeToFaceZone;
        point   (0.41 0 0);
        normal  (1 0 0);
    }
);

// ************************************************************************* //
